project-chip/connectedhomeip/src/platform/ESP32/ConnectivityManagerImpl.cpp
    return frequency;
}

static uint16_t MapFrequency(const uint16_t inBand, const uint8_t inChannel)
{
    uint16_t frequency = 0;

    if (inBand == WIFI_BAND_2_4GHZ)
    {
        frequency = Map2400MHz(inChannel);
    }
    else if (inBand == WIFI_BAND_5_0GHZ)
    {
        frequency = Map5000MHz(inChannel);
    }

    return frequency;
}

CHIP_ERROR ConnectivityManagerImpl::_GetAndLogWifiStatsCounters(void)
{
    CHIP_ERROR err;
    Schema::chip::Trait::Network::TelemetryNetworkWifiTrait::NetworkWiFiStatsEvent statsEvent;
    wifi_config_t wifiConfig;
    uint8_t primaryChannel;
    wifi_second_chan_t secondChannel;

    VerifyOrExit(_IsWiFiStationConnected() && _IsWiFiStationConnected(), err = CHIP_NO_ERROR);

    err = esp_wifi_get_config(ESP_IF_WIFI_STA, &wifiConfig);
    if (err != ESP_OK)
    {
        ChipLogError(DeviceLayer, "esp_wifi_get_config() failed: %s", chip::ErrorStr(err));
    }
    SuccessOrExit(err);

    err = esp_wifi_get_channel(&primaryChannel, &secondChannel);
    if (err != ESP_OK)
    {
        ChipLogError(DeviceLayer, "esp_wifi_get_channel() failed: %s", chip::ErrorStr(err));
    }
    SuccessOrExit(err);

    statsEvent.bssid            = (wifiConfig.sta.bssid[4] << 8) | wifiConfig.sta.bssid[5];
    statsEvent.freq             = MapFrequency(WIFI_BAND_2_4GHZ, primaryChannel);
    statsEvent.rssi             = 0;
    statsEvent.bcnRecvd         = 0;
    statsEvent.bcnLost          = 0;
    statsEvent.pktMcastRx       = 0;
    statsEvent.pktUcastRx       = 0;
    statsEvent.currTxRate       = 0;
    statsEvent.currRxRate       = 0;
    statsEvent.sleepTimePercent = 0;
    statsEvent.numOfAp          = 0;

    ChipLogProgress(DeviceLayer,
                    "WiFi-Telemtry\n"
                    "BSSID:         %x\n"
                    "freq:          %d\n"
                    "rssi:          %d\n"
                    "bcn recvd:     %d\n"
                    "bcn lost:      %d\n"
                    "mcast:         %d\n"
                    "ucast:         %d\n"
                    "rx rate:       %d\n"
                    "tx rate:       %d\n"
                    "sleep percent: %d\n"
                    "Num of AP:     %d\n",
                    statsEvent.bssid, statsEvent.freq, statsEvent.rssi, statsEvent.bcnRecvd, statsEvent.bcnLost,
                    statsEvent.pktMcastRx, statsEvent.pktUcastRx, statsEvent.currRxRate, statsEvent.currTxRate,
                    statsEvent.sleepTimePercent, statsEvent.numOfAp);

    chip::LogEvent(&statsEvent);

exit:
    return err;
}

CHIP_ERROR ConnectivityManagerImpl::_SetServiceTunnelMode(ServiceTunnelMode val)
{
    CHIP_ERROR err = CHIP_NO_ERROR;

    VerifyOrExit(val != kServiceTunnelMode_NotSupported, err = CHIP_ERROR_INVALID_ARGUMENT);

    mServiceTunnelMode = val;

    SystemLayer.ScheduleWork(DriveServiceTunnelState, NULL);

exit:
    return err;
}

bool ConnectivityManagerImpl::_IsServiceTunnelConnected(void)
{
    ChipTunnelAgent::AgentState tunnelState = ServiceTunnelAgent.GetChipTunnelAgentState();
    return (tunnelState == ChipTunnelAgent::kState_PrimaryTunModeEstablished ||
            tunnelState == ChipTunnelAgent::kState_PrimaryAndBkupTunModeEstablished ||
            tunnelState == ChipTunnelAgent::kState_BkupOnlyTunModeEstablished);
}

bool ConnectivityManagerImpl::_IsServiceTunnelRestricted(void)
{
    return ServiceTunnelAgent.IsTunnelRoutingRestricted();
}

bool ConnectivityManagerImpl::_HaveServiceConnectivityViaTunnel(void)
{
    return IsServiceTunnelConnected() && !IsServiceTunnelRestricted();
}

// ==================== ConnectivityManager Platform Internal Methods ====================

CHIP_ERROR ConnectivityManagerImpl::_Init()
{
    CHIP_ERROR err;

    mLastStationConnectFailTime     = 0;
    mLastAPDemandTime               = 0;
    mWiFiStationMode                = kWiFiStationMode_Disabled;
    mWiFiStationState               = kWiFiStationState_NotConnected;
    mWiFiAPMode                     = kWiFiAPMode_Disabled;
    mWiFiAPState                    = kWiFiAPState_NotActive;
    mServiceTunnelMode              = kServiceTunnelMode_Enabled;
    mWiFiStationReconnectIntervalMS = CHIP_DEVICE_CONFIG_WIFI_STATION_RECONNECT_INTERVAL;
    mWiFiAPIdleTimeoutMS            = CHIP_DEVICE_CONFIG_WIFI_AP_IDLE_TIMEOUT;
    mFlags                          = 0;

    // TODO Initialize the Chip Addressing and Routing Module.

    // Initialize the service tunnel agent.
    err = InitServiceTunnelAgent();
    SuccessOrExit(err);
    ServiceTunnelAgent.OnServiceTunStatusNotify = HandleServiceTunnelNotification;

    // Ensure that ESP station mode is enabled.
    err = ESP32Utils::EnableStationMode();
    SuccessOrExit(err);

    // If there is no persistent station provision...
    if (!IsWiFiStationProvisioned())
    {
        // If the code has been compiled with a default WiFi station provision, configure that now.
        if (CONFIG_DEFAULT_WIFI_SSID[0] != 0)
        {
            ChipLogProgress(DeviceLayer, "Setting default WiFi station configuration (SSID: %s)", CONFIG_DEFAULT_WIFI_SSID);

            // Set a default station configuration.
            wifi_config_t wifiConfig;
            memset(&wifiConfig, 0, sizeof(wifiConfig));
            memcpy(wifiConfig.sta.ssid, CONFIG_DEFAULT_WIFI_SSID, strlen(CONFIG_DEFAULT_WIFI_SSID) + 1);
            memcpy(wifiConfig.sta.password, CONFIG_DEFAULT_WIFI_PASSWORD, strlen(CONFIG_DEFAULT_WIFI_PASSWORD) + 1);
            wifiConfig.sta.scan_method = WIFI_ALL_CHANNEL_SCAN;
            wifiConfig.sta.sort_method = WIFI_CONNECT_AP_BY_SIGNAL;
            err                        = esp_wifi_set_config(ESP_IF_WIFI_STA, &wifiConfig);
            if (err != ESP_OK)
            {
                ChipLogError(DeviceLayer, "esp_wifi_set_config() failed: %s", chip::ErrorStr(err));
            }
            err = CHIP_NO_ERROR;

            // Enable WiFi station mode.
            err = SetWiFiStationMode(kWiFiStationMode_Enabled);
            SuccessOrExit(err);
        }

