project-chip/connectedhomeip/src/platform/ESP32/ConnectivityManagerImpl.cpp
const char * ConnectivityManagerImpl::WiFiAPStateToStr(WiFiAPState state)
{
    switch (state)
    {
    case kWiFiAPState_NotActive:
        return "NotActive";
    case kWiFiAPState_Activating:
        return "Activating";
    case kWiFiAPState_Active:
        return "Active";
    case kWiFiAPState_Deactivating:
        return "Deactivating";
    default:
        return "(unknown)";
    }
}

void ConnectivityManagerImpl::RefreshMessageLayer(void)
{
    CHIP_ERROR err = MessageLayer.RefreshEndpoints();
    if (err != CHIP_NO_ERROR)
    {
        ChipLogError(DeviceLayer, "MessageLayer.RefreshEndpoints() failed: %s", chip::ErrorStr(err));
    }
}

void ConnectivityManagerImpl::HandleServiceTunnelNotification(ChipTunnelConnectionMgr::TunnelConnNotifyReasons reason,
        CHIP_ERROR err, void * appCtxt)
{
    bool newTunnelState  = false;
    bool prevTunnelState = GetFlag(sInstance.mFlags, kFlag_ServiceTunnelUp);
    bool isRestricted    = false;

    switch (reason)
    {
    case ChipTunnelConnectionMgr::kStatus_TunDown:
        ChipLogProgress(DeviceLayer, "ConnectivityManager: Service tunnel down");
        break;
    case ChipTunnelConnectionMgr::kStatus_TunPrimaryConnError:
        ChipLogProgress(DeviceLayer, "ConnectivityManager: Service tunnel connection error: %s", ::chip::ErrorStr(err));
        break;
    case ChipTunnelConnectionMgr::kStatus_TunPrimaryUp:
        newTunnelState = true;
        isRestricted   = (err == CHIP_ERROR_TUNNEL_ROUTING_RESTRICTED);
        ChipLogProgress(DeviceLayer, "ConnectivityManager: %service tunnel established", (isRestricted) ? "RESTRICTED s" : "S");
        break;
    default:
        break;
    }

    // If the tunnel state has changed...
    if (newTunnelState != prevTunnelState)
    {
        // Update the cached copy of the state.
        SetFlag(sInstance.mFlags, kFlag_ServiceTunnelUp, newTunnelState);

        // Alert other components of the change to the tunnel state.
        ChipDeviceEvent event;
        event.Clear();
        event.Type                                  = DeviceEventType::kServiceTunnelStateChange;
        event.ServiceTunnelStateChange.Result       = GetConnectivityChange(prevTunnelState, newTunnelState);
        event.ServiceTunnelStateChange.IsRestricted = isRestricted;
        PlatformMgr().PostEvent(&event);

        // If the new tunnel state represents a logical change in connectivity to the service, as it
        // relates to the application, post a ServiceConnectivityChange event.
        // (Note that the establishment of a restricted tunnel to the service does not constitute a
        // logical change in service connectivity from the application's standpoint, as such a tunnel
        // cannot be used for general application interactions, only pairing).
        if (!newTunnelState || !isRestricted)
        {
            event.Clear();
            event.Type                                       = DeviceEventType::kServiceConnectivityChange;
            event.ServiceConnectivityChange.ViaTunnel.Result = (newTunnelState) ? kConnectivity_Established : kConnectivity_Lost;
            event.ServiceConnectivityChange.ViaThread.Result = kConnectivity_NoChange;
            event.ServiceConnectivityChange.Overall.Result   = sInstance.HaveServiceConnectivityViaThread()
                    ? kConnectivity_NoChange
                    : event.ServiceConnectivityChange.ViaTunnel.Result;
            PlatformMgr().PostEvent(&event);
        }
    }
}

} // namespace DeviceLayer
} // namespace chip
